src/ToolsInternational/src/DataProcessors/УИ_ЗагрузкаДанныхИзТабличногоДокумента/УИ_ЗагрузкаДанныхИзТабличногоДокумента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>УИ_ЗагрузкаДанныхИзТабличногоДокумента</name>
  <comment>Переписываем обработку почти заново, но с большим заимствованием кода из стандартной обработки для толстого клиента</comment>
  <attributes>
    <name>НеСоздаватьНовыхЭлементов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РучнаяНумерацияКолонокТабличногоДокумента</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПерваяСтрокаДанныхТабличногоДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РежимЗагрузки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СсылкаИсточника</name>
    <type>
      <types>DocumentRef</types>
      <types>CatalogRef</types>
    </type>
  </attributes>
  <attributes>
    <name>ТабличнаяЧастьИсточника</name>
  </attributes>
  <attributes>
    <name>ПередЗаписьюОбъекта</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПриЗаписиОбъекта</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПослеДобавленияСтроки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяВидаРегистра</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗамещатьСуществующиеЗаписи</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОбъектаСправочника</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныеСвойства</name>
  </attributes>
</mdclass:DataProcessor>

src/ToolsInternational/src/DataProcessors/УИ_ЗагрузкаДанныхИзТабличногоДокумента/Forms/ФормаРедактированияСобытий/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Процедура устанавливает текст надписи текста выражения
//
&НаКлиенте
Процедура УстановитьНадписьТекстВыражения()
	Если РежимЗагрузки = 1 Тогда

		Если Элементы.ГруппаПанель.ТекущаяСтраница.Имя = "ГруппаПослеДобавленияСтроки" Тогда

			НадписьТекстВыражения =
			"В тексте выражения можно использовать следующие предопределенные параметры:
			|   Объект         - Записываемый объект
			|   ТекущиеДанные  - Содержит данные загружаемой строки табличной части.
			|   ТекстыЯчеек    - массив текстов ячеек строки
			|Встроенные функции, функции общих модулей.";
		Иначе

			НадписьТекстВыражения =
			"В тексте выражения можно использовать следующие предопределенные параметры:
			|   Объект         - Записываемый объект
			|   Отказ          - Признак отказа от записи объекта
			|Встроенные функции, функции общих модулей.";

		КонецЕсли;

	ИначеЕсли РежимЗагрузки = 0 Тогда

		НадписьТекстВыражения =
		"В тексте выражения можно использовать следующие предопределенные параметры:
		|   Объект         - Записываемый объект
		|   Отказ          - Признак отказа от записи объекта
		|   ТекстыЯчеек    - массив текстов ячеек строки
		|Встроенные функции, функции общих модулей.";

	ИначеЕсли РежимЗагрузки = 2 Тогда
		НадписьТекстВыражения =
		"В тексте выражения можно использовать следующие предопределенные параметры:
		|   Объект         - Менеджер записи регистра сведений
		|   Отказ          - Признак отказа от записи объекта
		|   ТекстыЯчеек    - массив текстов ячеек строки
		|Встроенные функции, функции общих модулей.";
	КонецЕсли;

КонецПроцедуры // ()

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	Если РежимЗагрузки = 2 Тогда
		Элементы.ГруппаПанель.Страницы.ГруппаПередЗаписьюОбъекта.Заголовок = "Перед записью";
		Элементы.ГруппаПанель.Страницы.ГруппаПриЗаписиОбъекта.Заголовок =    "При записи";
	КонецЕсли;

	Элементы.ГруппаПослеДобавленияСтроки.Видимость = РежимЗагрузки = 1;
	УстановитьНадписьТекстВыражения();

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ УПРАВЛЕНИЯ

// Процедура - обаботчик события, при нажатии на кнопку "ОК" Командной панели "ОсновныеДействияФормы"
//
&НаКлиенте
Процедура ОсновныеДействияФормыОК(Команда)
	ОповеститьОВыборе(
		Новый Структура("Источник, Результат, ПередЗаписьюОбъекта, ПриЗаписиОбъекта, ПослеДобавленияСтроки",
		"ФормаРедактированияСобытий", Истина, ПередЗаписьюОбъекта.ПолучитьТекст(), ПриЗаписиОбъекта.ПолучитьТекст(),
		ПослеДобавленияСтроки.ПолучитьТекст()));
КонецПроцедуры

// Процедура - обаботчик события "ПриСменеСтраницы" в: Панель "Панель"
//
&НаКлиенте
Процедура ПанельПриСменеСтраницы(Элемент, ТекущаяСтраница)
	УстановитьНадписьТекстВыражения();
КонецПроцедуры
